run/LPBF_small/constant/location
ITEM: TIMESTEP
750000
ITEM: NUMBER OF ATOMS
47
ITEM: BOX BOUNDS mm mm mm
-1e-06 0.010001
-1.5e-06 0.0150015
-1e-05 0.10001
ITEM: ATOMS v_x1 v_y1 v_z1 v_rad1 
7.7104e-06 3.48153e-05 0.000107705 7.705e-06 
8.86994e-05 6.53779e-05 0.0001113 1.1301e-05 
1.13006e-05 5.63866e-05 0.0001113 1.1301e-05 
7.08577e-05 4.91893e-05 0.000112839 1.284e-05 
3.66189e-05 8.33157e-05 0.000114587 1.45885e-05 
9.00556e-05 0.000140055 0.000109944 9.945e-06 
6.40048e-05 0.000124869 0.000112838 1.284e-05 
3.24267e-05 2.84668e-05 0.000108754 8.755e-06 
2.76165e-05 0.000135412 0.000114588 1.45885e-05 
3.10215e-05 0.000111565 0.000109944 9.945e-06 
7.72833e-06 0.00014322 0.00010678 6.78e-06 
6.41126e-05 1.88307e-05 0.00011883 1.88315e-05 
1.89118e-05 9.73669e-05 0.000108754 8.755e-06 
9.00551e-05 8.65367e-05 0.000109944 9.945e-06 
7.70792e-06 0.000128023 0.000107705 7.705e-06 
6.21053e-05 7.33309e-05 0.000112839 1.284e-05 
8.71607e-05 0.000113768 0.000112839 1.284e-05 
5.05336e-05 0.000141245 0.000108755 8.755e-06 
7.15616e-05 9.38575e-05 0.000109944 9.945e-06 
9.12419e-05 1.43827e-05 0.000108755 8.755e-06 
3.82258e-05 9.94463e-06 0.000109944 9.945e-06 
1.4588e-05 1.45877e-05 0.000114587 1.45885e-05 
9.12459e-05 4.33644e-05 0.000108754 8.755e-06 
4.18087e-05 5.19121e-05 0.000116574 1.6575e-05 
3.36612e-05 9.94493e-06 0.000129302 9.945e-06 
8.86994e-05 3.44512e-05 0.000126538 1.1301e-05 
1.37951e-05 0.00014322 0.000128948 6.78e-06 
1.82753e-05 3.86381e-05 0.00012343 1.1301e-05 
2.33461e-05 6.68471e-05 0.000121629 7.705e-06 
5.10351e-05 0.000104567 0.0001113 1.1301e-05 
4.37667e-05 0.000120361 0.000116262 6.78e-06 
8.75484e-06 0.00011163 0.000108755 8.755e-06 
6.16598e-05 4.43696e-05 0.000134632 1.1301e-05 
4.63749e-05 0.000127404 0.000105965 5.965e-06 
9.00551e-05 9.63527e-05 0.000127243 9.945e-06 
5.90393e-05 9.19474e-05 0.000130259 1.284e-05 
7.59175e-05 6.46811e-05 0.000125348 7.705e-06 
9.51195e-06 9.68721e-05 0.000122257 7.705e-06 
1.13005e-05 7.89878e-05 0.0001113 1.1301e-05 
8.04941e-05 0.000135412 0.000132054 1.45885e-05 
6.97331e-05 0.000107117 0.000121449 7.705e-06 
6.78351e-06 0.000137298 0.000118965 6.78e-06 
3.72452e-05 0.000102996 0.000122888 6.78e-06 
7.70475e-06 2.57765e-05 0.000132599 7.705e-06 
6.77983e-06 5.17597e-05 0.000128184 6.78e-06 
8.75441e-06 6.948e-05 0.000128775 8.755e-06 
4.96601e-05 0.000135412 0.000133703 1.45885e-05 
