run/LPBF_small/constant/timeVsLaserPower
(
    (0                 10)
    (1e-8             100)
    (70e-6            100)
    (70.1e-6          0  )
    (100e-6           0  )
)